In [23]:
import numpy as np
import pandas as pd

In [24]:
data = pd.read_csv('C:\\Users\\mr\\OneDrive\\Desktop\\MovieRecommenderSystem\\USA_Housing.csv')

In [25]:
# show's top 5 entry of data
data.head()

,Avg. Area Income,Avg. Area House Age,Avg. Area Number of Rooms,Avg. Area Number of Bedrooms,Area Population,Price,Address
0,79545.458574,5.682861,7.009188,4.09,23086.800503,1.059034e+06,"208 Michael Ferry Apt. 674\nLaurabury, NE 3701..."
1,79248.642455,6.002900,6.730821,3.09,40173.072174,1.505891e+06,"188 Johnson Views Suite 079\nLake Kathleen, CA..."
2,61287.067179,5.865890,8.512727,5.13,36882.159400,1.058988e+06,"9127 Elizabeth Stravenue\nDanieltown, WI 06482..."
3,63345.240046,7.188236,5.586729,3.26,34310.242831,1.260617e+06,USS Barnett\nFPO AP 44820
4,59982.197226,5.040555,7.839388,4.23,26354.109472,6.309435e+05,USNS Raymond\nFPO AE 09386

In [26]:
# show's information of data
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 7 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   Avg. Area Income              5000 non-null   float64
 1   Avg. Area House Age           5000 non-null   float64
 2   Avg. Area Number of Rooms     5000 non-null   float64
 3   Avg. Area Number of Bedrooms  5000 non-null   float64
 4   Area Population               5000 non-null   float64
 5   Price                         5000 non-null   float64
 6   Address                       5000 non-null   object
dtypes: float64(6), object(1)
memory usage: 273.6+ KB

In [27]:
data = data.drop('Address', axis = 1)

In [28]:
data.head()

,Avg. Area Income,Avg. Area House Age,Avg. Area Number of Rooms,Avg. Area Number of Bedrooms,Area Population,Price
0,79545.458574,5.682861,7.009188,4.09,23086.800503,1.059034e+06
1,79248.642455,6.002900,6.730821,3.09,40173.072174,1.505891e+06
2,61287.067179,5.865890,8.512727,5.13,36882.159400,1.058988e+06
3,63345.240046,7.188236,5.586729,3.26,34310.242831,1.260617e+06
4,59982.197226,5.040555,7.839388,4.23,26354.109472,6.309435e+05

In [29]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   Avg. Area Income              5000 non-null   float64
 1   Avg. Area House Age           5000 non-null   float64
 2   Avg. Area Number of Rooms     5000 non-null   float64
 3   Avg. Area Number of Bedrooms  5000 non-null   float64
 4   Area Population               5000 non-null   float64
 5   Price                         5000 non-null   float64
dtypes: float64(6)
memory usage: 234.5 KB

In [30]:
x = data.drop('Price', axis = 1)

In [31]:
x.head()

,Avg. Area Income,Avg. Area House Age,Avg. Area Number of Rooms,Avg. Area Number of Bedrooms,Area Population
0,79545.458574,5.682861,7.009188,4.09,23086.800503
1,79248.642455,6.002900,6.730821,3.09,40173.072174
2,61287.067179,5.865890,8.512727,5.13,36882.159400
3,63345.240046,7.188236,5.586729,3.26,34310.242831
4,59982.197226,5.040555,7.839388,4.23,26354.109472

In [32]:
y = data['Price']

In [33]:
y.head()

0    1.059034e+06
1    1.505891e+06
2    1.058988e+06
3    1.260617e+06
4    6.309435e+05
Name: Price, dtype: float64

In [34]:
from sklearn.model_selection import train_test_split

In [39]:
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size = 0.3, random_state=20)

In [43]:
x_train.head()

,Avg. Area Income,Avg. Area House Age,Avg. Area Number of Rooms,Avg. Area Number of Bedrooms,Area Population
2103,55415.242260,5.639293,4.632911,2.39,24291.111910
3090,69603.690657,7.433065,5.097025,2.05,31337.780851
1419,60058.906154,6.367113,5.982669,4.38,33581.823709
106,78633.973755,5.465393,7.531143,3.24,43728.803486
4163,75728.698594,7.103988,4.384629,2.36,46231.026448

In [44]:
y_train.head()

2103    4.929846e+05
3090    1.054304e+06
1419    9.908932e+05
106     1.555321e+06
4163    1.517922e+06
Name: Price, dtype: float64

In [45]:
y_test.info()

<class 'pandas.core.series.Series'>
Int64Index: 1500 entries, 71 to 157
Series name: Price
Non-Null Count  Dtype
--------------  -----
1500 non-null   float64
dtypes: float64(1)
memory usage: 23.4 KB

In [46]:
x_train.shape

(3500, 5)

In [47]:
y_train.shape

(3500,)

In [52]:
x_test.head

<bound method NDFrame.head of       Avg. Area Income  Avg. Area House Age  Avg. Area Number of Rooms  \
71        83953.104839             7.385135                   6.898847
1561      76896.787031             4.349592                   8.608457
2439      61611.751784             5.994479                   7.009129
1294      59160.093352             6.265218                   7.046225
1946      70125.765843             5.051254                   4.765903
...                ...                  ...                        ...
3912      78199.455011             5.097763                   6.163615
345       73643.057298             6.766853                   8.337085
946       62820.179077             7.639741                   7.681444
1265      52046.543538             5.821221                   5.580975
157       56063.480867             5.106935                   5.385340

      Avg. Area Number of Bedrooms  Area Population
71                            3.08     37283.357646
1561                          4.40     52733.987984
2439                          3.34     18947.558346
1294                          3.17     23252.906213
1946                          4.34     22063.210619
...                            ...              ...
3912                          2.01     50241.040802
345                           3.34     43152.139577
946                           6.07     23734.169591
1265                          3.37     41715.545579
157                           4.14     39129.296705

[1500 rows x 5 columns]>

In [58]:
y_test.head()

71      1.789099e+06
1561    1.584440e+06
2439    8.942036e+05
1294    1.006886e+06
1946    6.194075e+05
Name: Price, dtype: float64

In [40]:
from sklearn.linear_model import LinearRegression

In [41]:
ln = LinearRegression()

In [42]:
ln.fit(x_train, y_train)

LinearRegression()

In [53]:
ln.score(x_test, y_test)

0.9139732846261402